# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_application.kv_sp: Reading...
data.azuread_application.kv_sp: Read complete after 2s [id=/applications/c28691c7-9899-4e43-8292-86b99b0ed3d8]
data.azuread_service_principal.aks_sp: Reading...
data.azuread_service_principal.aks_sp: Read complete after 0s [id=/servicePrincipals/624533ce-2ca8-47a9-886d-6e667defc442]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04MGJmZjNlNi0xNmM0LTQ4MzktOWNlOC02MGMxYTgzMWNlNTI7b2JqZWN0SWQ9YjU5YWI3YjktZGIzOC00YmQzLTg2MTQtZTZkMTBhZDcwYjExO3N1YnNjcmlwdGlvbklkPTdiNmY4ZjE1LTNhM2UtNDNhMi1iNmFjLThlYjZjMDZhZDEwMzt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_application_insights.adminapp_ai will be updated in-place
  ~ resource "azurerm_application_insights" "adminapp_ai" {
        id                                    = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/dd-test-adminapp-ai"
        name                                  = "dd-test-adminapp-ai"
      ~ tags                                  = {
          + "costcenter" = "altinn3"
          + "solution"   = "apps"
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.authz_ai will be updated in-place
  ~ resource "azurerm_application_insights" "authz_ai" {
        id                                    = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-test-authz-ai"
        name                                  = "oed-test-authz-ai"
      ~ tags                                  = {
          + "costcenter" = "altinn3"
          + "solution"   = "apps"
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.feedpoller will be updated in-place
  ~ resource "azurerm_application_insights" "feedpoller" {
        id                                    = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-test-feedpoller-ai"
        name                                  = "oed-test-feedpoller-ai"
      ~ tags                                  = {
          + "costcenter" = "altinn3"
          + "solution"   = "apps"
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.testapp_ai will be updated in-place
  ~ resource "azurerm_application_insights" "testapp_ai" {
        id                                    = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-testapp-ai"
        name                                  = "oed-testapp-ai"
      ~ tags                                  = {
          + "costcenter" = "altinn3"
          + "solution"   = "apps"
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_cdn_frontdoor_endpoint.endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "digdir-dd-test-authz"
    }

  # azurerm_cdn_frontdoor_firewall_policy.waf_policy will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "waf_policy" {
      + enabled                                   = true
      + frontend_endpoint_ids                     = (known after apply)
      + id                                        = (known after apply)
      + js_challenge_cookie_expiration_in_minutes = (known after apply)
      + mode                                      = "Prevention"
      + name                                      = "oedwafpolicytest"
      + request_body_check_enabled                = true
      + resource_group_name                       = "altinn-digdir-oed-tt02-rg"
      + sku_name                                  = "Premium_AzureFrontDoor"

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowOnlyTrustedIP"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "78.41.45.0",
                  + "51.13.16.142",
                  + "20.93.235.29",
                  + "20.93.236.182",
                  + "20.93.237.7",
                  + "20.93.237.73",
                  + "20.93.237.120",
                  + "20.93.237.169",
                  + "20.105.216.16",
                  + "20.73.190.5",
                  + "20.100.227.143",
                  + "20.100.227.146",
                  + "20.100.227.204",
                  + "20.100.227.206",
                  + "20.100.227.218",
                  + "20.100.227.225",
                  + "4.177.11.163",
                  + "131.163.51.169",
                  + "4.177.11.195",
                  + "131.163.58.163",
                  + "131.163.26.55",
                  + "131.163.51.223",
                  + "20.251.94.60",
                  + "20.251.0.49",
                  + "20.251.6.98",
                  + "20.251.7.82",
                  + "20.251.7.185",
                  + "20.100.225.51",
                  + "20.100.3.9",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = false
              + operator           = "IPMatch"
            }
        }
      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "DenyAllOthers"
          + priority                       = 100
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "0.0.0.0/0",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = false
              + operator           = "IPMatch"
            }
        }

      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_DefaultRuleSet"
          + version = "2.1"
        }
      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_BotManagerRuleSet"
          + version = "1.1"
        }
    }

  # azurerm_cdn_frontdoor_origin.app_origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "app_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + host_name                      = "oed-test-authz-app.azurewebsites.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "oed-appservice-origin-test"
      + origin_host_header             = "oed-test-authz-app.azurewebsites.net"
      + priority                       = 1
      + weight                         = 500
    }

  # azurerm_cdn_frontdoor_origin_group.origin_group will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "oed-origin-group-test"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + health_probe {
          + interval_in_seconds = 240
          + path                = "/health"
          + protocol            = "Https"
          + request_type        = "GET"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # azurerm_cdn_frontdoor_profile.fd_profile will be created
  + resource "azurerm_cdn_frontdoor_profile" "fd_profile" {
      + id                       = (known after apply)
      + name                     = "oed-fd-profile-test"
      + resource_group_name      = "altinn-digdir-oed-tt02-rg"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Premium_AzureFrontDoor"
    }

  # azurerm_cdn_frontdoor_route.route will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "default-route-test"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Https",
        ]
    }

  # azurerm_key_vault_secret.admin_app_client_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "admin_app_client_secret" {
      ~ expiration_date         = "2027-06-18T14:16:25Z" -> "2027-06-18T14:16:25.3694326Z"
        id                      = "https://oed-kv.vault.azure.net/secrets/dd-admin-app-client-secret/fea13654767041a1af90e5033b057e77"
        name                    = "dd-admin-app-client-secret"
      ~ not_before_date         = "2025-06-18T14:16:25Z" -> "2025-06-18T14:16:25.3694326Z"
        tags                    = {}
        # (8 unchanged attributes hidden)
    }

Plan: 6 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `pull_request` |
| Working Directory | `./infra/altinn-digdir-oed-tt02-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/test/altinn-digdir-oed-tt02-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_test_altinn-digdir-oed-tt02-rg.tfstate.tfplan`